In [2]:
people = {
    "first": ["Corey", 'Jane', 'John'],
    "last": ["Schafer", 'Doe', 'Doe'],
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [3]:
import pandas as pd

In [4]:
df = pd.DataFrame(people)

In [7]:
df['last'] == 'Doe'

0    False
1    False
2    False
Name: last, dtype: bool

In [11]:
filt = (df['last'] == 'Joe')

In [12]:
df[filt]

   first last                    email
0  Corey  Joe  CoreyMSchafer@gmail.com
1   Jane  Joe        JaneDoe@email.com
2   John  Joe        JohnDoe@email.com

In [10]:
df

   first last                    email
0  Corey  Joe  CoreyMSchafer@gmail.com
1   Jane  Joe        JaneDoe@email.com
2   John  Joe        JohnDoe@email.com